[
    {
      "title": "NILES - Multimodal Chatbot with Gemini ",
      "description": "NILES is an advanced multimodal chatbot leveraging Gemini models to process both text and images. Built with a modular architecture and a clean interface, NILES delivers an intuitive and powerful chat experience.",
      "image": "/projects_img/cover.png",
      "tags": ["GenAI", "LLMs", "AI bot"],
      "github": "https://github.com/DavidSilveraGabriel/NILES",
      "featured": true,
      "category": "AI Assistants",
      "duration": "3 meses",
      "role": "Desarrollador principal",
      "caseStudy": "NILES fue desarrollado como una soluci贸n para interactuar con modelos de IA multimodales de manera intuitiva y eficiente.",
      "challenge": "El principal desaf铆o fue crear una interfaz que permitiera a los usuarios aprovechar al m谩ximo las capacidades multimodales de Gemini, manteniendo una experiencia fluida y accesible.",
      "solution": "Implementamos una arquitectura modular que separa claramente la interfaz de usuario de la l贸gica de procesamiento, permitiendo una f谩cil extensi贸n y mantenimiento. La interfaz fue dise帽ada con principios de UX minimalistas para facilitar la interacci贸n.",
      "outcome": "El resultado es un chatbot que permite a los usuarios interactuar con Gemini de manera natural, combinando texto e im谩genes en sus consultas y obteniendo respuestas contextuales de alta calidad."
    },
    {
      "title": " MewAI - Feline Agent Crew",
      "description": "MewAI is a multi-agent system powered by crewAI, utilizing 'feline agents' enhanced by Gemini to automate blog content creation. These agents collaborate on tasks involving web research, content drafting, and content review.",
      "image": "/projects_img/mewai.png",
      "tags": ["GenAI", "LLMs", "AI bot","AI Agents","CrewAI"],
      "github": "https://github.com/DavidSilveraGabriel/MewAI",
      "featured": true,
      "category": "AI Agents",
      "duration": "2 meses",
      "role": "Arquitecto de agentes",
      "caseStudy": "MewAI surgi贸 como una exploraci贸n de sistemas multi-agente para la creaci贸n automatizada de contenido de alta calidad.",
      "challenge": "Coordinar m煤ltiples agentes especializados para que trabajen juntos de manera coherente, cada uno con su propio rol y responsabilidades en el proceso de creaci贸n de contenido.",
      "solution": "Utilizamos el framework crewAI para orquestar los agentes, asignando roles espec铆ficos (investigador, redactor, editor) y definiendo flujos de trabajo claros entre ellos. Cada agente fue potenciado con Gemini para mejorar sus capacidades.",
      "outcome": "El sistema es capaz de generar art铆culos de blog completos y bien investigados con m铆nima intervenci贸n humana, manteniendo un tono consistente y calidad editorial."
    },
    {
      "title": "Analyze and classify public domain EEG(ML) signals",
      "description": "analyze and classify public domain EEG signals with deep ConvNets for decoding imagined and executed movements",
      "image": "/projects_img/eeg.png",
      "tags": ["Python", "mne", "Pandas", "braindecode", "EEG"],
      "github": "https://github.com/DavidSilveraGabriel/EEG-classification",
      "link": "https://github.com/DavidSilveraGabriel/EEG-classification/blob/master/Using_mne_and_braindecode.ipynb",
      "category": "Machine Learning",
      "duration": "1 mes",
      "results": "Precisi贸n del 85% en clasificaci贸n",
      "caseStudy": "Este proyecto explor贸 la aplicaci贸n de redes neuronales convolucionales para la clasificaci贸n de se帽ales EEG relacionadas con movimientos imaginados y ejecutados.",
      "challenge": "Las se帽ales EEG son notoriamente ruidosas y variables entre sujetos, lo que hace que su clasificaci贸n sea un problema complejo de aprendizaje autom谩tico.",
      "solution": "Implementamos una arquitectura de red neuronal convolucional profunda utilizando la biblioteca braindecode, especializada en procesamiento de se帽ales EEG. Aplicamos t茅cnicas de preprocesamiento avanzadas con mne para mejorar la calidad de las se帽ales.",
      "outcome": "Logramos una precisi贸n de clasificaci贸n del 85%, superando los m茅todos tradicionales y demostrando el potencial de las redes neuronales profundas para interfaces cerebro-computadora."
    },
    {
      "title": "Data Science Resources",
      "description": "A list of Data Science resources for everyone",
      "image": "https://images.unsplash.com/photo-1666875753105-c63a6f3bdc86?fm=jpg&q=60&w=3000&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8N3x8ZGF0YSUyMHNjaWVuY2V8ZW58MHx8MHx8fDA%3D",
      "tags": ["Data", "Machine Learning"],
      "github": "https://github.com/DavidSilveraGabriel/Data-science-resources",
      "category": "Recursos"
    },
    {
      "title": "Computer Pointer Controller",
      "description": "Computer Pointer Controller app estimate pose of head and is used to control the movement of mouse pointer by the direction of eyes.",
      "image": "/projects_img/openvino.png",
      "tags": ["Machine Learning", "Deep Learning", "AI"],
      "github": "https://github.com/DavidSilveraGabriel/Intel--Edge-AI-for-IoT-Developers---Project-3",
      "category": "Computer Vision",
      "caseStudy": "Este proyecto explora el control del cursor del ordenador mediante el seguimiento de la mirada y la posici贸n de la cabeza.",
      "challenge": "Implementar un sistema de seguimiento ocular preciso que funcione en tiempo real con recursos computacionales limitados.",
      "solution": "Utilizamos el kit de herramientas OpenVINO de Intel para optimizar modelos de visi贸n por computadora preentrenados, permitiendo inferencias r谩pidas incluso en hardware de gama baja.",
      "outcome": "Creamos una aplicaci贸n que permite controlar el cursor del ordenador con movimientos de la cabeza y direcci贸n de la mirada, demostrando el potencial de la IA en el borde para interfaces de usuario alternativas."
    },
    {
      "title": "Deploy a People Counter App at the Edge",
      "description": "The app will detect people in a designated area, providing the number of people in the frame, average duration of people in frame, and total count.",
      "image": "/projects_img/nanodegree.png",
      "tags": ["Machine Learning", "Deep Learning", "AI"],
      "github": "https://github.com/DavidSilveraGabriel/Intel--Edge-AI-for-IoT-Developers---Project-1",
      "category": "Computer Vision",
      "caseStudy": "Desarrollo de una aplicaci贸n de conteo de personas para implementaci贸n en dispositivos de borde.",
      "challenge": "Crear un sistema de conteo de personas preciso que pueda funcionar en dispositivos con recursos limitados y en tiempo real.",
      "solution": "Implementamos un modelo de detecci贸n de personas optimizado con OpenVINO, junto con algoritmos de seguimiento para mantener la identidad de las personas a trav茅s de los fotogramas.",
      "outcome": "La aplicaci贸n puede contar personas con precisi贸n, calcular su tiempo de permanencia en el 谩rea designada y proporcionar estad铆sticas 煤tiles para an谩lisis de tr谩fico en espacios comerciales o p煤blicos."
    }
]